{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Banking Chatbot",
        "Hello",
        "Hey",
        "Whats up?",
        "I need help",
        "Hi",
        "Can you help?"
      ],
      "responses": [
        "Hello sir, Do you need any help?",
        "Hello, Your banking chatbot is here for you.",
        "Hi sir, what can I do for you?",
        "Hi sir, how can I help you?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "Thanks for interacting! Hope that was helpful. You can type quit to exit now",
        "Bye sir, Have a good day. You can type quit to exit now",
        "Bye! Please visit the bank for more queries. You can type quit to exit now"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "Thank you for helping", "You are helpful"],
      "responses": ["I am very happy to help you.", "You're welcome sir!", "Welcome sir, You can ask other queries as well."]
    },
    {
      "tag": "bank",
      "patterns": [
        "Bank",
        "Tell me about your bank",
        "I want to know more about this bank",
        "How is this bank?"
      ],
      "responses": [
        "The bank was established in 2014 A.D and has many branches in different areas. The bank has been awarded as best bank multiple times."
      ]
    },
    {
      "tag": "mobanking",
      "patterns": [
        "Mobile banking",
        "Mobanking",
        "Does the bank provide mobile banking services?",
        "Tell me about mobanking services bank provides.",
        "I want to know about mobile banking"
      ],
      "responses": [
        "We do provide mobile banking services which is available to choose when you open the account in the bank.",
        "The mobile banking service can be activated when you open an account and it can be connected to other e-payment systems."
      ]
    },
    {
      "tag": "policy",
      "patterns": [
        "policy of bank",
        "I want to know about bank's policy",
        "Do you know about policy of your bank?",
        "Tell me about bank's policy.",
        "How is the policy of the bank?"
      ],
      "responses": [
        "There are different policies for different fields in our bank. Please go through the other materials to know about them. It may include health policy, financial policy, internet policy and many more."
      ]
    },
    {
      "tag": "loan",
      "patterns": [
        "Loan",
        "Can I know about loan?",
        "Whats the interest rate for loan?",
        "I want to know something about loan",
        "Does your bank provide loan?",
        "Tell me about loan"
      ],
      "responses": [
        "There are different types of loan that the bank provides like student loan, business loan and farmer loan. The interest rate starts from 5%."
      ]
    },
    {
      "tag": "user",
      "patterns": [
        "Account",
        "My account",
        "I want to know about my account",
        "How much in account",
        "Can I get details of my account from here?",
        "Can I get my account details?",
        "Account details"
      ],
      "responses": [
        "Please provide me your correct account number to proceed or type quit to exit and start conversation with me again."
      ]
    },
    {
      "tag": "bankAccount",
      "patterns": [
        "Bank Account",
        "New Account",
        "How can I open new account in your bank?",
        "Whats the process to open new account in your bank?",
        "Open new account"
      ],
      "responses": [
        "You need to visit bank with documents. The documents are your citizenship and two passport size photos. The bank will charge you Rs 1000 for new account."
      ]
    }
  ]
}